In [1]:
import numpy as np
import pandas as pd

In [3]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[7,8,9]}

In [5]:
df = pd.DataFrame(d)

In [7]:
df

     A    B  C
0  1.0  5.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [9]:
df.dropna()

     A    B  C
0  1.0  5.0  7

In [11]:
df.dropna(axis = 1)

   C
0  7
1  8
2  9

In [15]:
df.dropna(thresh=2) #Require that many non-NA values.

     A    B  C
0  1.0  5.0  7
1  2.0  NaN  8

In [17]:
df

     A    B  C
0  1.0  5.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [23]:
df.fillna(2)

     A    B  C
0  1.0  5.0  7
1  2.0  2.0  8
2  2.0  2.0  9

In [29]:
df['A'].fillna(df['A'].mean())     #here we're filling mean of values in columns inside nan value in column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64